###################################匯入模組############################################
# 匯入 tkinter 模組
from tkinter import *


###################################定義函數############################################
def hi():
    # 按下按鈕後，在終端機印出訊息
    print("hi singular")


###################################建立視窗############################################
# 建立一個主視窗，之後所有元件都會放在這個視窗裡
windows = Tk()

# 設定視窗標題，會顯示在視窗最上方的標題列
windows.title("My first GUI")

###################################建立按鈕############################################
# Button(放在哪個視窗裡，text=按鈕文字，command=要執行的函式)
# 注意 : command=hi 不要加括號，這樣才會在 按鈕被按下時執行
btnl = Button(windows, text="click me", command=hi)

# pack()會把按鈕放進主視窗裡
btnl.pack()
###################################建立標籤############################################
# Label用來放在視窗裡顯示文字
# label(放在哪個視窗裡，text=要顯示的文字，fg=文字顏色，bg=背景顏色)s
display = Label(windows, text="Hello!", fg="blue", bg="#ffffff")
# pack()會把標籤放進主視窗裡
display.pack()
###################################運行應用程式########################################
# 啟動主迴圈，讓視窗持續開著並等待使用者操作
windows.mainloop()
